{
  "topic": "tata punch",
  "total_posts": 158,
  "date_computed": "2025-12-15T00:48:32.150531",
  "engagement": {
    "average": 366.1645569620253,
    "median": 16.0,
    "max": 27785.0,
    "min": 1.0,
    "std": 2293.77194947275,
    "top_25_percent": 70.75,
    "top_10_percent": 366.70000000000294
  },
  "sentiment": {
    "average_polarity": 0.14301850812067593,
    "positive_posts": 92,
    "negative_posts": 5,
    "neutral_posts": 61
  },
  "timing": {
    "best_hours": {
      "13": 2796.5,
      "11": 1090.1666666666667,
      "21": 837.0,
      "6": 798.2857142857143,
      "5": 266.06666666666666
    },
    "best_days": {
      "Thursday": 2594.3636363636365,
      "Monday": 431.6666666666667,
      "Friday": 263.88461538461536
    },
    "worst_hours": {
      "23": 5.0,
      "1": 6.0,
      "18": 7.75
    }
  },
  "content": {
    "avg_length": 1697.4493670886077,
    "avg_words": 297.50632911392404,
    "hashtag_usage": 5.69620253164557,
    "url_usage": 6.962025316455696,
    "emoji_usage": 10.759493670886076
  },
  "impact": {
    "hashtag_boost": {
      "with": 130.0,
      "without": 380.4295302013423,
      "improvement_pct": -65.82809964011008
    },
    "url_impact": {
      "with": 77.27272727272727,
      "without": 387.78231292517006,
      "improvement_pct": -80.07316870905392
    },
    "emoji_impact": {
      "with": 109.47058823529412,
      "without": 397.11347517730496,
      "improvement_pct": -72.43342392588988
    }
  },
  "top_posts": [
    {
      "text": "",
      "engagement": 27785,
      "sentiment_polarity": 0.0
    },
    {
      "text": "",
      "engagement": 6049,
      "sentiment_polarity": 0.0
    },
    {
      "text": "",
      "engagement": 3563,
      "sentiment_polarity": 0.0
    },
    {
      "text": "I don’t remember much from my childhood. I lived in a small town south of Kraków with my mom, dad, and two sisters. Those early days are a blur, but I remember going door to door around the neighborhood, asking for treats during the Dożynki harvest festival. It was a tradition of ours, since we knew the neighbors always bought too much candy. We’d gather leftovers and make a feast of our own. At every door you were greeted with a cheeky smile as the neighbors lovingly cussed out the scoundrel children of the Dabrowski home.\n\nOf course, happy memories are happy for a reason – because things get worse, and you get something to compare them to. My parents separated. My mother moved us to Warszawa, where we could be closer to my grandparents and uncles. Meanwhile my father, Jaromir, did his best to stay in our lives, but it got harder and harder. He needed to work longer and longer hours, but he still sent us money every month. He wanted us to have a beautiful life; even if he couldn’t be there for it.\n\nWith every passing year, those visits grew further and further away. First, we lost Easter. Then Christmas. Then the birthdays. And finally, our yearly Dożynki festival meetup.\n\nLast we heard of him, he was barely making ends meet. He wasn’t sending money anymore. And over time, he disappeared into memory.\n\n \n\nMy mother remarried. My sisters graduated. My oldest sister moved to Ljubljana, while my younger went to Munich. My mother stayed in Warszawa with her new husband, but once the kids were out of the picture, she moved into her summer home up north. I love my mother dearly, but she’s always had an eye for the luxurious. Always planning the next trip, the next sunbaked afternoon.\n\nI stayed in Warszawa. I got myself a degree in sociology and managed to hold on to a low-rank government job at ZUS overseeing private claims. It wasn’t glamorous – it was mostly being yelled at in different ways – but it paid the bills. A mind-numbing battle of making decisions, defending them, and making them again.\n\n \n\nThe year I turned 24, I got a letter from an estate lawyer. Turns out, my father had passed away. This wasn’t recent. According to the papers, he’d passed away several years ago. Some kind of accident with farm equipment. He didn’t have a proper will, and dividing the estate among his living descendants hadn’t been a state priority. It got lost in a folder somewhere, and now it had floated back up. They’d divided everything equally between me and my sisters. My youngest sister got his savings. My oldest got his car and valuables. And I, well… I got the house.\n\nI called the others to check who wanted to go see his grave. No one wanted to – they were all tangled up in their own lives and troubles. My family were under the impression that my father had abandoned us, and this was a way for us to abandon him back.\n\nI had a different impression. I always thought he was just working too hard. I decided I’d take some time off work to collect his things and check out the property, trying to get a better idea of why he’d distanced himself from us. And maybe I could get a better picture of my early life – that time where I was greeted with a smile rather than a complaint.\n\n \n\nIt was a long drive. The roads out there aren’t the best. It’s a very small community with no more than about 250 people. Most of which are wheat farmers, and there’s not that much to do. There are only two things other than farms; a church and a store.  Everything else is either too far away or too irrelevant.\n\nGoing past the endless fields, I got so lulled into a rhythm that I almost missed the exit. It’s so small that you can accidentally pass it by if you don’t take the right turn; there are no signs. You can only recognize it from the church in the distance. I took a left turn and prayed to God the suspension would hold a little longer. I decided to pay the old church a visit – we’d spent a lot of time there.\n\nThere was plenty of parking. It was smaller than I remembered, but then again, everything looked bigger back then.\n\n \n\nThere is something uneasy about coming home after so long. As I stepped out of the car, it all just came back to me. The smells, the sounds. Even if you can’t put your finger on it, there’s something that tickles the mind as if to remind you – this is where you belong.\n\n“Welcome!” a voice called out. “Sorry about the, uh… the state of things.”\n\nI turned around to see a man, a couple of years older than myself. He had well-combed hair and thick glasses. He was wearing a priest’s garb. I’d almost forgot – the village priest had been old even back when I was young. No wonder there was a new one.\n\n“I’m Father Czerniak,” he continued. “Are you new in town, or passing through?”\n\n“I grew up here,” I said. “I’m one of the Dabrowski kids.”\n\n“Sorry, I’m not familiar,” he smiled. “I only came here last winter to pick up the work from Father Gawlik.”\n\n“He lived until last winter?” I asked. “Are you sure?”\n\n“Quite so,” he laughed. “101 years old.”\n\n“I can’t believe it,” I smiled. “God really does have a sense of humor.”\n\n \n\nFather Czerniak showed me around. He told me his plans for refurbishing the windows. But the one thing that irked him more than anything was the doors.\n\nSee, they were gone. The church was wide open.\n\n“It’s a local superstition,” he sighed. “A shepherd needs his gate to tend his flock. But every time I put the doors up, someone takes them down.”\n\n“Strange,” I said. “I’ve never heard that before.”\n\n“Really? I thought you were from the area.”\n\n“Guess I’ve been gone too long, Father.”\n\nThe church looked naked, in a way. No barriers. I could see the gravel they’d dragged in, forgetting to wipe their feet. Father Czerniak had tried to put up some curtains, but the wind had torn them down piece by piece.\n\nBefore I left, he showed me my father’s grave. It’d been vandalized. The headstone had tipped over, and there were no flowers. I promised myself to make it a little nicer before I left. But I didn’t understand. Sure, my family wasn’t perfect, but we’d never been hated. This grave looked outright despised.\n\nI thanked Father Czerniak and made my way across town.\n\n \n\nI wasn’t prepared for what I saw.\n\nAll through town, there were these wide-open houses, just like the church. At first, I thought it was some kind of summer cleaning going on, but no – all doors were *gone*. They weren’t just open, they were *removed*. I could see all the way into people’s living rooms. The hustle and bustle as homeowners moved from kitchen to bedroom, talking amongst themselves.\n\nI slowed down and looked a little closer. Not a single room had a door. Not even the bathrooms. A couple of them had curtains or insect nets put up; but no doors. House after house, completely open to the elements. A couple of them had welcome mats by the windows in their living rooms, as if to show that this was the way to enter. A couple of them had completely bricked the entrances where their front doors used to be, sealing it.\n\nSure, small towns can get a bit quirky – but I’d never seen anything like this.\n\n \n\nI pulled up to an all-too-familiar driveway, and gasped. I couldn’t recognize my home.\n\nIt’d been vandalized. Every window broken, every door removed. I could see rats scurrying around. Walking around the property, things got even worse. There’d been a small fire in the backyard, spreading to the outer wall of the kitchen. It wasn’t completely burned down, but you could probably punch straight through with little effort. And finally, on the far side; neon-green spray paint reading ‘*syn diabła*’ – son of the Devil.\n\nI couldn’t believe it. They’d even clipped the chains off our swing set, leaving a rusted metal skeleton. It looked like someone had tried to start a tire fire but couldn’t quite get it going. I had a hard time even picturing what it used to look like. There was this bottomless hole forming in my stomach where every smile I remembered seemed like a cruel taunt.\n\nSomething must’ve happened. Something I’d never even heard of.\n\n \n\nComing back around, I noticed a crowd of middle-aged men. They were standing just outside the property, looking over my car. I didn’t recognize any of them.\n\n“You with the bank?” one of them asked.\n\n“No, I’m the Dabrowski kid,” I said. “The son.”\n\n“You’re the son?!” he spat. “You wanna join him in Hell? Is that it?”\n\n“You know who did this?” I snapped back, pointing at the house. “Was it you?”\n\n“Could’ve been anyone,” a man in the back added. “Fucker deserved it.”\n\nOne of them gave me a knowing smile and nodded at the graffiti. They whispered something among themselves, letting out a chuckle under their breaths. They scoffed at me and wandered off, spitting curses and sneers. Not quite the welcome I’d imagined.\n\n \n\nI’d initially planned on sleeping in the old house, but there was no way. Not only was it wide open, it was a disgusting mess. I’m not gonna go into detail what they’d done to the place, but I’d be lucky if I was able to *give it* away in its current state.\n\nI decided to spend the night sleeping in my car. I leaned the seat back and wrapped myself in a blanket, hoping it wouldn’t get too cold. I spent some time on my phone, but I didn’t want to use all the battery. But somehow, I still ended up staying awake long past midnight.\n\nBut there was something beautiful about that night. The sunset was one of the few things that didn’t change around those parts. Watching the sun go down over the same old fields gave me that feeling that some things never change.\n\n \n\nI remember waking up sometime around 2 am, seemingly for no reason. It wasn’t cold, there was no one bothering me, and no notifications on my phone. A careful wind brushed against the hood of the car. I lay there for a moment, trying to ignore the texture of the seat sinking into my sweaty skin.\n\nI filtered out the sounds of nature bleeding in from outside. A distant part of me had heard them all before. I listened past the songbirds, and the insects in the fields. And beyond that, there was something else. Something in the distance.\n\nA wail. A deep, sorrowful, wail.\n\n \n\nThe following day, I took some time to walk around town. The rumor that Jaromir’s kid was back had spread like wildfire; I could tell by the sideways looks as people passed me on the street. The only ones who didn’t seem to care were the kids, and they were few and far between.\n\nAt the far end of the town there was this long brick wall. It wasn’t very high, but it was dense. It had doors built directly into it. Dozens of them; every door from every house in the neighborhood. They’d jammed them all straight into the brick. I couldn’t see ours though.\n\nIt had an eerie look to it. Maybe a hundred or more doors, all built to never be opened. I couldn’t help but touch a few handles, making sure they didn’t budge.\n\n \n\nThere were a couple of teenage kids standing at the edge of the wall, observing me. I walked up to them, surprised to see they didn’t back down. They had a cocky look to them, but at least they weren’t openly hostile. Before I could say anything, they turned to me.\n\n“My mom hates you,” one of them said. “What’d you do?”\n\n“I used to live around here,” I said. “Came to get some things.”\n\n“Why’d you come back?” he scoffed. “I’m leaving the *moment* I can afford it.”\n\n“Same,” said the other, rolling an unlit cigarette between his fingers.\n\nI gave them a tired  look. A man passed us further down the street, throwing daggers at me with his eyes. Talking to the wrong person would get my teeth knocked out, for sure. I turned to the kids, lowering my voice.\n\n“I’m Dabrowski’s son,” I admitted. “That’s why they hate me.”\n\nThe second kid nearly dropped his cigarette.\n\n \n\nI managed to bribe them into a conversation with the promise of a six pack from the next town over. In return, they’d give me the unofficial tour of what’d happened these past few years. A fair trade, I suppose. I’d apparently missed quite a lot.\n\nWe wandered to the east side of town. There was an old farm that’d stood there for ages. It didn’t really have a name; it’d just been part of the background. It was barely even a frame anymore, it was just the outline of what’d once been a home.\n\nIt’d started years ago. People heard knocking coming from that ruin. It used to have this door that still stood, clinging to the edge of a rotted-out doorframe.\n\n \n\n“You could hear it at night,” one of the kids explained. “Knock knock. Like a door to Hell.”\n\n“Sounds awful,” I said.\n\n“Not to everyone,” the other kid sighed. “There was one guy who *liked* it.”\n\nIt wasn’t a hard guess as to whom that might’ve been.\n\n \n\nRumor was my dad had gone up there one night and opened the door. It’d crumbled off the hinges, and according to the townsfolk, something stepped through. Some called it the Devil. A couple of kids thought it was an alien. Most locals just called it Ślepiec.\n\n“It came through, and the door broke,” the first kid said. “And now it can’t go back.”\n\n“So you’re saying it’s still here?” I asked. “It’s real?”\n\n“Well, yeah,” he laughed. “Why do you think this place is so fucked up?”\n\n“Then what’s with the doors?”\n\n“It’s looking for a way back to Hell,” he said. “And when it can’t find the right door, it gets angry. And then it hurts people.”\n\n \n\nŚlepiec. That’s what they called it. An ugly word for a blind man, or mole. They liked to call it that because of its terrible vision, mistaking every door for the one it was looking for. For years, Ślepiec had moved from house to house, knocking on every door it could find. And if someone opened, it would do something terrible. People had gone missing. A couple had died.\n\nI drove my adolescent guides to the other town over to get them their promised beer. They told me all they could as we went. It felt a bit weird driving off with a couple of teenagers, but I got the impression that these two had done far worse for far less. Delinquents, but honest ones.\n\nAt first, people had hidden in their homes – but then Ślepiec had knocked until the doors broke. Then it would knock on the inner doors. So over time, people removed their doors. Those who didn’t would get a visit at some point. With all the discarded doors, they built the brick wall; tricking Ślepiec into knocking around at night.\n\n \n\n“This can’t be true,” I said. “It’s absurd.”\n\n“It’s true,” the first kid said. “That’s why they hate your dumb dad. He let it in.”\n\n“But it doesn’t make sense. Why don’t you just pack up and leave?”\n\n“I’m gonna,” the first kid said. “I *told* you.”\n\nThe second kid pondered the question for a while, then shrugged at his friend. He answered as if he’d thought about it a hundred times.\n\n*\"Wszędzie dobrze, ale w domu najlepiej.\"*\n\n ‘Everywhere is good – but home is best’. Of course he’d say that. Come Hell or high water, home is home.\n\n \n\nI got them their six pack and some fast food. I got some for myself while I was at it. It wasn’t a long drive all in all, but long enough to be a bother. By the time we got back, it was almost dark. They rushed out of the car, waving a hasty goodbye. As they did, the second kid called back to me.\n\n“Go see for yourself!” he said. “Ślepiec comes out at night!”\n\nHe pointed down the street towards the brick wall. I nodded at them in a silent thanks. I didn’t believe them. I had to see Ślepiec for myself.\n\n \n\nIf what I’d heard the previous night was any indication, Ślepiec would be out somewhere after midnight, so I went to bed early. And when I say bed, I mean sleeping in my car for the second night in a row. I was miserable. I considered leaving first thing in the morning, but there was this deep sadness in me that I couldn’t shake. This was my old home. I’d played in these fields. It felt wrong knowing I was no longer welcome.\n\nMy dad was many things, but no Devil’s son. If he opened that door, it must’ve been for a good reason. And if he let through something that shouldn’t be here, it must’ve been an honest mistake. He was not an evil man, but he was fallible.\n\nThen again, maybe he didn’t have a choice. Maybe Ślepiec didn’t give him a choice either.\n\n \n\nI must’ve nodded off at some point. I forgot to set an alarm, but I still woke up at about 2:30 am. I considered going back to sleep, but I decided to have one last look around town. I’d promised myself I would. So I got out of the car, stretched, and listened.\n\nIt was easier that night. There was a noise that cut straight through the ambience – that wailing. It was clearer. Even in the dark, I could tell where it came from.\n\n \n\nThe houses had turned off their lights, leaving the streets lit up with nothing but the moon. Still, I knew those streets. I could follow them in my sleep.\n\nI made my way to a dirt path, leading me past the two houses at the edge of town, and straight to the brick wall. At that point, I could hear it clear as day. It was a man wailing at the top of his lungs; crying his soul out. Bawling like a child.\n\nI could see the brick wall in the distance. The sharp contour of the bricked-in doors stood out against the moonlight like a long, flat, abstract painting. And in the middle of it all, there was a dark silhouette.\n\n \n\nIt looked like a man. Sort of. I couldn’t really tell what he was like, he had a bulky jacket on. He was pulling on one of the doors, smacking it over and over with a closed fist. It was the same pattern, over and over. Pull, smack smack. Pull, smack smack. And in between every attempt, he jerked his head around, crying desperately.\n\nI considered walking up to him. This wasn’t some kind of devil, this was a heartbroken man. As I took a few steps closer, I noticed something in the corner of my eye. A light.\n\nI turned around only to notice a small flashlight coming from one of the nearby houses. They were filming me with their phones. Looking closer, I could see two little heads peeking out, shaking their heads in a certain ‘no’.\n\nTurning back to the brick wall, I heard a sudden crack.\n\nThe man had pulled one of the doors straight out of the wall. It came loose. He set it down next to him, and with one hand, pushed it downward. He didn’t even have a good grip, but with a single hand, he broke the door into pieces.\n\n \n\nThe wailing turned into a scream. Rage. Unfiltered, unhindered, rage. With just his fingers, he began to rip bricks straight out of the wall, tossing them around like leaves in the wind. I could hear them landing around me, kicking up tufts of grass.\n\nI backed away as the lights in the house went out. The little heads dipped away from the window. I hurried down the dirt path as I watched Ślepiec climb on top of the brick wall, screaming at the top of his lungs. Even at a distance, I could tell something was off. His proportions seemed wrong. It was hard to tell – he’d wrapped himself in some kind of dark fabric. But something about him didn’t look right.\n\nI didn’t stop to stare. Say what you will. Maybe it was just a strange man. Either way, I was looking at something dangerous. And when the locals turn to hide, you do best to follow suit. So I hurried down the dirt path, hearing his terrifying scream echo across the fields.\n\n \n\nI barely slept that night. It is one thing to believe in monsters, and another thing to see them. As soon as the sun rose, I drove off.\n\nBut as I went past the church, I noticed something. There was a white van outside, and one of the church doors had been put back up. There were two men on ladders getting ready to put the other door up; it was hidden under a tarp just off to the side. I could see Father Czerniak up front with a big smile on his face.\n\nI decided to see what was going on. Surely, he had to know what the hell he was doing.\n\n \n\nThe moment I parked my car, Father Czerniak waved me over. He was right next to me before my boots hit the gravel.\n\n“Welcome back!” he smiled. “Glad to see you haven’t left us yet!”\n\nI closed the car door and yawned a little.\n\n“What are you doing?” I asked. “What is this?”\n\n“You inspired me,” he said. “For an outsider, this place must have looked awful. I saw it, you know. I saw it in your face.”\n\nHe turned back to the church as the two carpenters began tipping up the second door.\n\n“It must be dignified,” he continued. “Our Lady deserves better, don’t you think?”\n\n“This is a bad idea,” I said. “I’ve seen that thing around town.”\n\nFather Czerniak shook his head and put a hand on my shoulder. This was a man who was trained to talk to people – I could tell.\n\n“If the Lord’s house can’t shelter you from the Devil, what can?”\n\n \n\nIn exchange for a little manual labor, I was offered a hot shower and a proper meal. After sleeping in my car for a couple of days, I couldn’t say no. Smooth-talker or not, Father Czerniak seemed an honest man. He believed what he spoke of.\n\nAs the hours passed, more and more people dropped by. Mostly townsfolk coming by to cuss him out for being an idiot. Some of them threw rocks at the doors, demanding he take them down. Others, in turn, thought it was about time someone at the church had some balls. Just like Father Czerniak had said; if a house of the Lord can’t shelter you from evil, what can?\n\nBy late afternoon, there was a significant gathering of people. Even those who had acted in anger earlier in the day were swayed. The argument was simple; do they not trust in God?\n\n \n\nThere was a bit of a cookout. Some brought sausages or steak for dinner. I spotted the two teenagers in the crowd, stealing a bit of wine from one of the elderly. I lost track of time. It felt a bit like the harvest festival back in the day – something that draw the town out of hiding. The sounds and smells were the same, and I could see from the smiles in the crowd that I wasn’t the only one feeling that way.\n\nLater in the day, Father Czerniak held a sermon. I don’t remember much of it; I was having trouble staying awake. That, if anything, felt just like when I was a kid. It’s amazing how something as stiff as church pews can be so lulling. But there was one part that stuck with me.\n\n“The door is a *threshold*,” he said. “And the door of a *church* is the threshold between the vile, and the *sacred*. Between sin and *saint*. We can no longer live in uncertainty. We must live as we teach – and we are proud to say, we have been taught well!”\n\n \n\nThe sermon continued into the evening. It ended just after sunset. Some people wandered home, but others were shamed to stay. It was no longer just a public gathering; it had turned into a *challenge*. The faith of the congregation pitted against the Devil itself. Some went home to gather blankets and pillows, laying down to sleep on the floor.\n\nThis wasn’t easy for them. Some talked about the people who’d disappeared over the years. People who’d opened the door when Ślepiec first came to knock. An elderly woman had gotten her neck broken. One man had been dragged out into the yard and hung from a tree. Another man had been mutilated.\n\n“It pulled his arm right out of the socket,” they whispered. “We found it across the street.”\n\n \n\nI tried talking to people, but it was clear that no one wanted anything to do with me. I was still Jaromir’s boy. The only ones who didn’t seem to mind were the two teenagers I’d talked to earlier. Later that evening, they walked up to me. Probably just to piss off their parents.\n\n“Aren’t you scared?” one asked.\n\n“Should I be?”\n\n“It’s got a bloodied tooth for you,” the other said.\n\n“I don’t think so,” I smiled. “I’ve only seen it once.”\n\n“Yeah, but-“\n\nThey quieted down, looking at one another, then back at me. I was missing something.\n\n“Your dad,” they said. “Ślepiec got him. Did no one tell you?”\n\n \n\nThey hadn’t. Turns out, it wasn’t malfunctioning farming equipment that’d killed him, years ago. It was Ślepiec. My dad had been the first victim on the list. Most of the villagers had considered this a sinner getting his just reward – others figured that if you play stupid games, you win stupid prizes. They’d found him tangled in the swing set – his body broken and mangled.\n\nThe kids left me alone with my thoughts for a while. They could tell I wasn’t all there. It was one thing to have him dead, but to die in such a horrifying way was unthinkable. I could barely picture him in my mind, and now there was a new image vying for my attention. Rattling chains. Dripping blood.\n\nBut there wasn’t much time to think. As the clock passed midnight, someone came knocking.\n\n \n\nThe church fell silent. Something pulled on the handles. Two smacks. Pull on the handle again. These doors were massive, and the hinges had just been reinforced, but I could still see them struggle. Father Czerniak took a deep breath. As the congregation fell silent, he spoke aloud.\n\n“This is no place for sons of sin!” he said. “There is nothing for you to corrupt!”\n\nIt all stopped.\n\nWe all breathed a sigh of relief. But the two teenagers didn’t look too convinced. They’d huddled up on the far side of the church. There was an emergency exit in one of the side rooms.\n\nThe door moved again. This time, with more determination. The handles were pulled even harder, and the smacking made the entire slab of wood crackle like a sinking ship.\n\nThen, the wailing. The loud, desperate, wailing. As soon as I heard it, I could see the color drain from the congregation’s faces.\n\n \n\nThe door was pulled back and forth, back and forth. A chandelier started to shake.\n\n“The door’s coming down!” someone called out. “It’s coming down, now!”\n\nFather Czerniak tried to calm them, but it was too late. People flooded the rear exit of the church, trying to get away. I was pushed aside without much thought. If the Dabrowski kid bit the bullet, all the better, as far as these people were concerned.\n\n“There is no sin in the house of the Lord!” Father Czerniak yelled. “There is no sin! The Devil can laugh and jeer as much as he likes, but there is no place for his evil!”\n\n \n\nBut thoughtful words can’t stop a broken door. Ślepiec wasn’t deterred.\n\nThe doors came down. There was a pause in the air as they fell. The air swept through the room, blowing out most of the candles among the pews. As the doors hit the ground, the crowd panicked.\n\nMost of them were already on their way out. People screamed. Others cursed. I was in the far back of the crowd, and it was clear I was never going to make it out without being crushed. I settled instead for hiding among the front pews, hoping the dark would shield me.\n\n \n\nI could barely see Ślepiec in the flickering candlelight. His right arm had grown out of his shoulder blade, and his left arm was so long that it scraped against the floor. He had a sort of hunchback pose, but there was something that kept moving on his back – fluttering, like a shivering membrane. He wasn’t wearing a coat – he just wasn’t *human*. He looked like something vaguely trying to resemble a human.\n\nEven Father Czerniak ran, hiding behind the altar. Ślepiec rushed through the room in a messy gallop, knocking over pews as he went. They didn’t even slow him down. When he got to the side room, people had already run screaming into the night.\n\nŚlepiec couldn’t catch them. Instead he settled on throwing things across the room, tearing down whatever he could reach, and breaking whatever he could lay his hands on. His wailing had turned to rage – and he was out of control.\n\n \n\nI was laying flat on my stomach, crawling away. Father Czerniak wasn’t so lucky.\n\nJust like Ślepiec had done with the brick wall, he climbed up on the altar. From there, he could see the priest.\n\nI don’t like to recall what I saw. It’s unworthy to make spectacle of tragedy. But Ślepiec didn’t care for titles, or words. He didn’t care about anything. He picked Father Czerniak up with a single arm, holding him outstretched in front of him like a child considering an unfamiliar vegetable.\n\nFather Czerniak tried his best. In between desperate cries, he said the most powerful words he knew. He compelled. He demanded. And when nothing seemed to work, he begged and prayed.\n\nThen Ślepiec unhinged his jaw like a snake. The screaming stopped with a snap as a spray of blood shot out. Something thumped against the altar and rolled onto the wooden floor. A pair of glasses clattered against the ground. Ślepiec spat and coughed, picking tufts of hair from his teeth. He let the body slip from his grip, drooping unceremoniously to the red carpet.\n\n \n\nI remember crawling. I crawled as quietly and carefully as I could. Ślepiec was big, but his footsteps were light – like he was tiptoeing everywhere he went. I didn’t notice he was behind me until his shadow drowned me. I rolled around, only to see his vast shape towering over me. He must’ve seen me. There were still a couple of candles.\n\nFor a moment, I saw his face. A half-made gray thing with black, inward-leaning concave eyes. A faint shimmer, like scales from a fish. A human mouth with an extra mandible. A twitching nose adjusting to the smell of burnt wax and blood. Viscera still dripped from his strange lips.\n\nThen he grabbed me. Carefully. Slowly.\n\nI closed my eyes as I was pulled in closer. He looked at me. He looked close. I could feel the heat of his mouth.\n\nPerhaps I’d be tastier.\n\n \n\nThen he made a noise. I can’t put my finger on what kind of noise it was, but I’d never heard it before. A squeal, perhaps. A confused rattle. He put me back down.\n\nI opened my eyes as those large black eyes turned away from me. He was leaving. His rage subsided. As he dragged his long arm across the floor, his wailing bubbled back up. But it wasn’t as desperate.\n\nIt was confused.\n\n \n\nThe effects of the attack was immediate. Some went to get their hunting gear. Others were blaming the priest, saying he wasn’t ‘holy enough’. Others were leaving town entirely. After all, if God couldn’t save them, they had to save themselves.\n\nI made my way back to my father’s home. There was so much he’d never told me, and it was too late to ask. I had no idea what kind of mess he’d been wrapped up in, but I couldn’t stand by and wait for it to blow over. If this was his fault – if all of this was his fault – I’d gladly join the others to spit at his name.\n\nBut I couldn’t do it without knowing for sure. I *had* to be sure.\n\n \n\nI went room by room, pulling out drawers and kicking over boxes. I threw around moth-eaten clothes. I tipped the bed. I dragged down the wardrobe, crashing it into the wooden floor, hoping I could find something – anything – to answer my questions.\n\nFinally, I ran out into the backyard. I saw the stains on the swing set. I remember him pushing me on it, making the chains creak as I went higher and higher. But now that noise meant something else. Something dark. An image of a broken man, wrapped in a forgotten toy.\n\nI don’t know how long I went berserk on that house. But I remember finally just taking a swing at it. As I mentioned, a part of the kitchen had burned – you could punch right through it.\n\nSo I did.\n\n \n\nTurns out, there was a secret panel beneath the kitchen sink.\n\nI didn’t register it at first. I just thought I’d hit a second, harder, wall. But as I calmed down and looked a little closer, I realized it was a small compartment under the sink. I’d punched right through, from the outside. I sat down flat on the wet grass, feeling it soaking into my jeans, as I dug around.\n\nThere was a box.\n\n \n\nMost of it was tainted by rats. Part of it was burnt. But there were little bits and bobs that I could make sense of.\n\nFamily albums. Mostly pictures of me and my sisters. Friends from around the village. A picture of dad next to his first car. Pictures from our Facebook, printed and framed. The kind of things one would like to keep.\n\nThen the pictures stopped. No more dates, no more birthdays. Nothing. But I kept turning the pages – and in the back there was something else. *Other* pictures. Notes.\n\n \n\nPictures of a door, with a text written on the back.\n\n‘It’s not screaming – it’s *crying’*.\n\nLittle notes on the margin. Saying ‘it’ was afraid. ‘It’ was lost. That no one listened, and that no one cared.\n\n \n\nThere were no more pictures, but there were notes.\n\n‘He had to get out – wants to stay.’\n\n‘He hunts elk in the forest – brings it to me.’\n\n‘There’s nothing left for him. I understand.’\n\nIt told a story of my father trying to help something that didn’t belong. Something from another place. They shared meals and kindness, trying their best to find common ground. This had, seemingly, gone on for months. It spoke of spring, and later, winter.\n\n‘I will let him sleep in the house,’ the final note said. ‘Maybe it can help his night terrors.’\n\nSomething must’ve happened. A dangerous creature like that, inside a small house. Maybe there was an accident. A misunderstanding. Maybe it strung him up by the chains to make him look alive – like a puppet.\n\nEither way, I was close to an answer. Maybe I was looking more like my father than I’d realized\n\n \n\nLooking back at it, I felt like a sleepwalker. I wasn’t thinking clearly. Maybe it was the adrenaline. I walked around in a daze, making my way back into town. It was quieter now – many had rushed to their cars. I followed the dirt road back to the brick wall, and I found him. Ślepiec, wailing weakly, tapping against the bricked-in doors. Pulling a little on a handle, hoping against hope that something would happen.\n\nHe wasn’t angry when I approached. He was confused. I had to make him understand – to see the truth of things. So despite everything I’d seen, and everything I heard, I decided to trust my instinct. My father had made many mistakes, but he was no fool. His mistakes were honest.\n\nSo if this was a mistake, I prayed to God it would be an honest one.\n\n“Follow me,” I said. “This way.”\n\n \n\nŚlepiec had feather-light steps. I could still hear commotion around town, but it was all swallowed by that soft wailing. Ślepiec couldn’t stop himself.\n\nWe made our way to the cemetery. To the overturned headstone, and the overgrown lot. I tapped the ground, looked at this creature, and said it as simple as I could.\n\n“Here,” I said. “Father.”\n\n \n\nPerhaps it understood me. Perhaps it didn’t. But it could rip out handfuls of dirt like if it was nothing, and it did. It took a long time, but not as long as it should have. My dad had not been buried deep, or well. Just as no one had cared for his funeral, no one had cared about his resting place.\n\nIt didn’t take long for Ślepiec to make his way down. And as his hands hit the casket, I looked down to a curious sight. See, my father had died poor. So poor that they hadn’t put much effort into his casket. It was more like a box, and the lid looked familiar. Looking a little closer, I realized it was a door. The actual front door of our house. They’d just thrown it on and called it a day.\n\nŚlepiec stroked the door with his long fingers, his wail slowing to a hum.\n\nHe’d finally found the right door. The one he’d been looking for.\n\nI’ll never forget that image for as long as I live. An ungodly creature breaking open the casket lid, pushing away a bed of dry blue sunflowers. Lifting a long-forgotten corpse from its resting place, cradling it like a mother calming a crying child. Its wailing turning to a quiet sob.\n\n‘*Tata*,’ he cried. ‘*Tata’*.\n\n \n\nŚlepiec wandered off into the night. Past the men with guns, and those hunkering down in their houses. He did not care. Maybe he’d never cared. Maybe he’d just been angry that he couldn’t find the right door.\n\nBut as the chaos settled, there’d be no need to hide your doors any longer.\n\nŚlepiec was gone.\n\n \n\nI sold my father’s property but kept the photo albums. His name is still spoken like a curse, but at least there’s nothing to keep that curse alive. There have been no more sightings of Ślepiec, as far as I know.\n\nThe locals didn’t want to point fingers at the Devil when they called the authorities. Some tried, but it’s easier to convince people of a killer rather than a monster. There were inquiries around the countryside, but as with most things it was left in an open-ended folder in an office somewhere. Unsolved. Deprioritized.\n\nI returned to Warszawa. It might not be my home, but home is not just a place – it’s a time. And that time has long passed. It has taken some effort to accept that for now, I might not have a real home. But that doesn’t mean I’ll *never* have one.\n\nMuch like Ślepiec, I think there’s a struggle in finding someplace you belong.\n\n\n\nBut over the southern countryside, the forest lies still.\n\nThere is no wailing. No knocking. No screaming.\n\nAnd I think that somewhere, beyond the trees, anyone can find a place to call home.",
      "engagement": 3055,
      "sentiment_polarity": 0.016928554535215558
    },
    {
      "text": "",
      "engagement": 2556,
      "sentiment_polarity": 0.0
    },
    {
      "text": "Even founder of atomberg is frustrated by Tata service.\n\nI have my friends owning Tata. Cars are fantastic no issues in that. Majorly the issue is their rude and untrained service center which are running as govt. Companies, no risk of getting terminated.\n\nEven you see big reviewer like gagan who mentioned about his service experience of his tata punch EV in which he was facing child seat issue. They mentioned: Sir ye th aisa hi h thik ni ho payega. I mean why you make cars if can't fix issue.\n",
      "engagement": 1423,
      "sentiment_polarity": -0.1357142857142857
    },
    {
      "text": "I started getting a 'Limited Performance Mode Activated' warning on my Tata Punch.ev yesterday . The error was intermittent during the day and a stop and start would make it go away sometimes. There was no noticeable change in power delivery.\n\nStill, when the warning came on, the beeps were consistent and loud and I decided to take the car to the service center today. While driving to the SC, in the middle of overtaking a truck on the highway the car just decided to give up. No limp mode, no warning, nothing, completely dead. Thankfully I wasn't at high speeds and the vehicles behind me were concertrating on the road and I was able to somehow slow down and park on the side.\n\nI'm currently waiting for their tow truck to arrive. This was a harrowing experience. Kudos to the service center though for being consistent though. Consistently clueless. They have been of zero help so far.",
      "engagement": 1135,
      "sentiment_polarity": 0.022530345471521936
    },
    {
      "text": "",
      "engagement": 1114,
      "sentiment_polarity": 0.0
    },
    {
      "text": "NOTE : NON OC POST ⚠️",
      "engagement": 1026,
      "sentiment_polarity": 0.0
    },
    {
      "text": "",
      "engagement": 1018,
      "sentiment_polarity": 0.0
    }
  ]
}